In [1]:
from sklearn.preprocessing import StandardScaler
import pandas as pd
data = {
    "Student_ID": [101, 102, 103, 104, 105, 105, 106],
    "Name": ["Aarav", "isha", "Rohan", "Meera", None, "Kabir", "   Aarav"],
    "Age": [20, None, 19, "22", 20, 20, 19],
    "Department": ["CSE", "it", "ECE", "CSE", "mech", "ME", "CSE "],
    "Marks": [85, 90, None, 88, 76, 76, 101],
    "Attendance(%)": [92, "85%", 80, None, 70, 70, 110]
}
df = pd.DataFrame(data)
print(df)

   Student_ID      Name   Age Department  Marks Attendance(%)
0         101     Aarav    20        CSE   85.0            92
1         102      isha  None         it   90.0           85%
2         103     Rohan    19        ECE    NaN            80
3         104     Meera    22        CSE   88.0          None
4         105      None    20       mech   76.0            70
5         105     Kabir    20         ME   76.0            70
6         106     Aarav    19       CSE   101.0           110

In [2]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     7 non-null      int64
 1   Name           6 non-null      object
 2   Age            6 non-null      object
 3   Department     7 non-null      object
 4   Marks          6 non-null      float64
 5   Attendance(%)  6 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 464.0+ bytes
None

In [3]:
print(df.describe(include="all"))

        Student_ID   Name   Age Department       Marks  Attendance(%)
count     7.000000      6   6.0          7    6.000000            6.0
unique         NaN      6   3.0          6         NaN            5.0
top            NaN  Aarav  20.0        CSE         NaN           70.0
freq           NaN      1   3.0          2         NaN            2.0
mean    103.714286    NaN   NaN        NaN   86.000000            NaN
std       1.799471    NaN   NaN        NaN    9.444575            NaN
min     101.000000    NaN   NaN        NaN   76.000000            NaN
25%     102.500000    NaN   NaN        NaN   78.250000            NaN
50%     104.000000    NaN   NaN        NaN   86.500000            NaN
75%     105.000000    NaN   NaN        NaN   89.500000            NaN
max     106.000000    NaN   NaN        NaN  101.000000            NaN

In [4]:
print(df.isnull().sum())

Student_ID       0
Name             1
Age              1
Department       0
Marks            1
Attendance(%)    1
dtype: int64

In [5]:
df["Name"] = df["Name"].astype(str).str.strip()
df["Department"] = df["Department"].astype(str).str.strip()

In [6]:
df

   Student_ID   Name   Age Department  Marks Attendance(%)
0         101  Aarav    20        CSE   85.0            92
1         102   isha  None         it   90.0           85%
2         103  Rohan    19        ECE    NaN            80
3         104  Meera    22        CSE   88.0          None
4         105   None    20       mech   76.0            70
5         105  Kabir    20         ME   76.0            70
6         106  Aarav    19        CSE  101.0           110

In [7]:
df["Name"] = df["Name"].fillna("Unknown")
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")
df["Marks"] = pd.to_numeric(df["Marks"], errors="coerce")
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())
df["Attendance(%)"] = df["Attendance(%)"].astype(str).str.replace("%", "", regex=False)
df["Attendance(%)"] = pd.to_numeric(df["Attendance(%)"], errors="coerce")
df["Attendance(%)"] = df["Attendance(%)"].fillna(df["Attendance(%)"].median())

In [8]:
df = df.drop_duplicates(subset=["Student_ID", "Name"], keep="first")

In [9]:
df["Marks"] = df["Marks"].clip(0, 100)
df["Attendance(%)"] = df["Attendance(%)"].clip(0, 100)

In [10]:
scaler = StandardScaler()
df["Marks_scaled"] = scaler.fit_transform(df[["Marks"]])
print(df[["Marks","Marks_scaled"]])

   Marks  Marks_scaled
0   85.0     -0.111073
1   90.0      0.536853
2   86.0      0.018512
3   88.0      0.277683
4   76.0     -1.277340
5   76.0     -1.277340
6  100.0      1.832705

In [11]:
df

   Student_ID   Name   Age Department  Marks  Attendance(%)  Marks_scaled
0         101  Aarav  20.0        CSE   85.0           92.0     -0.111073
1         102   isha  20.0         it   90.0           85.0      0.536853
2         103  Rohan  19.0        ECE   86.0           80.0      0.018512
3         104  Meera  22.0        CSE   88.0           82.5      0.277683
4         105   None  20.0       mech   76.0           70.0     -1.277340
5         105  Kabir  20.0         ME   76.0           70.0     -1.277340
6         106  Aarav  19.0        CSE  100.0          100.0      1.832705